aboutHadoop/flumeConf.org
#+TITLE: Flume的配置说明

使用Flume将日志文件入库HDFS，直接上配置文件

#+BEGIN_SRC

# agent
agent_aWifi.sources = spooldirsource-aWifi
agent_aWifi.sinks = spooldirsink-aWifi
agent_aWifi.channels = memoryChannel-aWifi

# source
agent_aWifi.sources.spooldirsource-aWifi.type = spooldir
agent_aWifi.sources.spooldirsource-aWifi.spoolDir = /home/qzt_java/data/input/
# 忽略.tmp结尾的文件
agent_aWifi.sources.spooldirsource-aWifi.ignorePattern = ^(.)*\\.tmp$
agent_aWifi.sources.spooldirsource-aWifi.fileHeader = true
agent_aWifi.sources.spooldirsource-aWifi.channels = memoryChannel-aWifi

# channel
agent_aWifi.channels.memoryChannel-aWifi.type = memory
agent_aWifi.channels.memoryChannel-aWifi.capacity = 1000

agent_aWifi.channels.fileChannel-aWifi.type = file
agent_aWifi.channels.fileChannel-aWifi.checkpointDir = /home/qzt_java/flume/fileChannel-aWifi/checkpoint
agent_aWifi.channels.fileChannel-aWifi.dataDirs = /home/qzt_java/flume/fileChannel-aWifi/data

# sink
agent_aWifi.sinks.spooldirsink-aWifi.type = hdfs
agent_aWifi.sinks.spooldirsink-aWifi.channel = memoryChannel-aWifi
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.path = hdfs://namenode01/user/zhaogj/springLog/
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.filePrefix = aWifiLog
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.fileSuffix = .txt
# 默认值：false, 是否启用时间上的”舍弃”，这里的”舍弃”，类似于”四舍五入”，后面再介绍。如果启用，则会影响除了%t的其他所有时间表达式；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.round = true
# 默认值：1, 时间上进行“舍弃”的值；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.roundValue = 60
# 默认值：seconds, 时间上进行”舍弃”的单位，包含：second,minute,hour
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.roundUnit = second
# 间隔60秒将临时文件滚动成最终目标文件
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.rollInterval = 60
# 默认值：1024, 当临时文件达到该大小（单位：bytes）时，滚动成目标文件;如果设置成0，则表示不根据临时文件大小来滚动文件；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.rollSize = 0
# 默认值：10, 当events数据达到该数量时候，将临时文件滚动成目标文件；如果设置成0，则表示不根据events数据来滚动文件；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.rollCount = 0
# 默认值：0,当目前被打开的临时文件在该参数指定的时间（秒）内，没有任何数据写入，则将该临时文件关闭并重命名成目标文件;
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.idleTimeout = 0
# 默认值：100, 每个批次刷新到HDFS上的events数量；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.batchSize = 100

#+END_SRC

启动命令
#+BEGIN_SRC
#!/bin/bash
for i in `ps aux | grep flume-ng | grep CDH | grep jdk1.8.0_73 | awk '{print$2}'`
do
  echo "kill "$i
# no -9
  kill $i
done
flume-ng agent --conf-file ./conf/flume_aWifi.conf --name agent_aWifi > /dev/null 2>&1 &
#+END_SRC

注意：kill不要加-9，否则hdfs中就有未写完的文件
