aboutHadoop/flumeConf.html
<!doctype html>
<html lang="en">
<head>
<title>Flume的配置说明</title>
<!-- 2017-01-07 Sat 23:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="赵光建">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Flume的配置说明</h1>
<p>
使用Flume将日志文件入库HDFS，直接上配置文件
</p>

<pre class="example">
# agent
agent_aWifi.sources = spooldirsource-aWifi
agent_aWifi.sinks = spooldirsink-aWifi
agent_aWifi.channels = memoryChannel-aWifi

# source
agent_aWifi.sources.spooldirsource-aWifi.type = spooldir
agent_aWifi.sources.spooldirsource-aWifi.spoolDir = /home/qzt_java/data/input/
# 忽略.tmp结尾的文件
agent_aWifi.sources.spooldirsource-aWifi.ignorePattern = ^(.)*\\.tmp$
agent_aWifi.sources.spooldirsource-aWifi.fileHeader = true
agent_aWifi.sources.spooldirsource-aWifi.channels = memoryChannel-aWifi

# channel
agent_aWifi.channels.memoryChannel-aWifi.type = memory
agent_aWifi.channels.memoryChannel-aWifi.capacity = 1000

agent_aWifi.channels.fileChannel-aWifi.type = file
agent_aWifi.channels.fileChannel-aWifi.checkpointDir = /home/qzt_java/flume/fileChannel-aWifi/checkpoint
agent_aWifi.channels.fileChannel-aWifi.dataDirs = /home/qzt_java/flume/fileChannel-aWifi/data

# sink
agent_aWifi.sinks.spooldirsink-aWifi.type = hdfs
agent_aWifi.sinks.spooldirsink-aWifi.channel = memoryChannel-aWifi
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.path = hdfs://namenode01/user/zhaogj/springLog/
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.filePrefix = aWifiLog
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.fileSuffix = .txt
# 默认值：false, 是否启用时间上的”舍弃”，这里的”舍弃”，类似于”四舍五入”，后面再介绍。如果启用，则会影响除了%t的其他所有时间表达式；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.round = true
# 默认值：1, 时间上进行“舍弃”的值；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.roundValue = 60
# 默认值：seconds, 时间上进行”舍弃”的单位，包含：second,minute,hour
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.roundUnit = second
# 间隔60秒将临时文件滚动成最终目标文件
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.rollInterval = 60
# 默认值：1024, 当临时文件达到该大小（单位：bytes）时，滚动成目标文件;如果设置成0，则表示不根据临时文件大小来滚动文件；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.rollSize = 0
# 默认值：10, 当events数据达到该数量时候，将临时文件滚动成目标文件；如果设置成0，则表示不根据events数据来滚动文件；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.rollCount = 0
# 默认值：0,当目前被打开的临时文件在该参数指定的时间（秒）内，没有任何数据写入，则将该临时文件关闭并重命名成目标文件;
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.idleTimeout = 0
# 默认值：100, 每个批次刷新到HDFS上的events数量；
agent_aWifi.sinks.spooldirsink-aWifi.hdfs.batchSize = 100
</pre>

<p>
启动命令
</p>
<pre class="example">
#!/bin/bash
for i in `ps aux | grep flume-ng | grep CDH | grep jdk1.8.0_73 | awk '{print$2}'`
do
  echo "kill "$i
# no -9
  kill $i
done
flume-ng agent --conf-file ./conf/flume_aWifi.conf --name agent_aWifi &gt; /dev/null 2&gt;&amp;1 &amp;
</pre>

<p>
注意：kill不要加-9，否则hdfs中就有未写完的文件
</p>
</div><div class="col-md-3"></div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: 赵光建</p>
<p class="date">Created: 2017-01-07 Sat 23:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
